import { createStore } from 'vuex'

export default createStore({
  state: {
    sectionTitle: {
      title1: 'схема работы',
      title2: 'Контрактное производство',
      title3: 'собственные торговые марки',
      title4: 'Отношение к делу и к клиентам',
      title5: 'Производим аэрозольную продукцию для разных сфер',
      title6: 'Блог экспертов в области производства',
      title7: 'Хотите сотрудничать?',
      title8: 'о компании',
      title9: 'мы - эксперты в области производства химии',
      title10: 'Наше производство',
      title11: 'Исследовательский центр Aliance production',
      title12: 'Автомобильная химия',
      title13: 'Контрактное производство автомобильной химии',
      title14: 'Изготовление автохимии',
      title15: 'Виды автохимии',
      title16: 'Автохимия AG-Tech',
      title17: 'Собственное производство автохимия AG-Tech',
      title18: 'Генеральный дистрибьютор премиальной автохимии',
      title19: 'Политика конфиденциальности',
      title20: 'Контакты',
      title21: 'Блог',
      title22: 'Современная методология разработки одухотворила всех причастных',
      title23: 'Так же вас может заинтересовать:',
    },
    pageLinks: {
      title1: 'Главная'
    }
  },
  getters: {},
  mutations: {},
  actions: {},
  modules: {}
})
