<template>
  <div id="config">
    <transition appear @before-enter="beforeEnterOne" @enter="enterOne">
      <div class="hero__layer">
        <transition
          appear
          @before-enter="beforeEnterPreloader"
          @enter="enterPreloader"
        >
          <img src="../assets/img/preloader.svg" alt="" />
        </transition>
      </div>
    </transition>
    <div class="page__section">
      <div class="container">
        <div class="section">
          <img src="../assets/img/line.svg" alt="" />
          <h1 class="section__title">
            {{ $store.state.sectionTitle.title19 }}
          </h1>
          <p class="section__link">
            <router-link class="section__link--item" :to="{ name: 'home' }">
              {{ $store.state.pageLinks.title1 }}</router-link
            >
            — Политика конфиденциальности
          </p>
        </div>
      </div>
    </div>
    <div class="container">
      <p class="config__text">
        Внезапно, тщательные исследования конкурентов призывают нас к новым
        свершениям, которые, в свою очередь, должны быть объявлены нарушающими
        общечеловеческие нормы этики и морали. Безусловно, внедрение современных
        методик представляет собой интересный эксперимент проверки направлений
        прогрессивного развития! Как принято считать, элементы политического
        процесса формируют глобальную экономическую сеть и при этом -
        подвергнуты целой серии независимых исследований.<br /><br />
        Курс на социально-ориентированный национальный проект представляет собой
        интересный эксперимент проверки распределения внутренних резервов и
        ресурсов. Господа, экономическая повестка сегодняшнего дня не даёт нам
        иного выбора, кроме определения соответствующих условий активизации.
        Значимость этих проблем настолько очевидна, что постоянный
        количественный рост и сфера нашей активности предоставляет широкие
        возможности для соответствующих условий активизации. Имеется спорная
        точка зрения, гласящая примерно следующее: тщательные исследования
        конкурентов могут быть обнародованы. Социально-экономическое развитие
        предопределяет высокую востребованность укрепления моральных
        ценностей.<br /><br />
        Безусловно, высокотехнологичная концепция общественного уклада позволяет
        оценить значение прогресса профессионального сообщества. Таким образом,
        глубокий уровень погружения требует определения и уточнения системы
        массового участия.<br /><br />
        Безусловно, экономическая повестка сегодняшнего дня обеспечивает
        актуальность существующих финансовых и административных условий. Как
        принято считать, некоторые особенности внутренней политики освещают
        чрезвычайно интересные особенности картины в целом, однако конкретные
        выводы, разумеется, указаны как претенденты на роль ключевых факторов.
        Базовые сценарии поведения пользователей будут рассмотрены исключительно
        в разрезе маркетинговых и финансовых предпосылок. Повседневная практика
        показывает, что высококачественный прототип будущего проекта играет
        определяющее значение для укрепления моральных ценностей. Ясность нашей
        позиции очевидна: базовый вектор развития обеспечивает широкому кругу
        (специалистов) участие в формировании инновационных методов управления
        процессами. Таким образом, реализация намеченных плановых заданий не
        даёт нам иного выбора, кроме определения переосмысления
        внешнеэкономических политик.<br /><br />
        Задача организации, в особенности же дальнейшее развитие различных форм
        деятельности предопределяет высокую востребованность экономической
        целесообразности принимаемых решений. Господа, перспективное
        планирование влечет за собой процесс внедрения и модернизации
        поставленных обществом задач. Кстати, независимые государства набирают
        популярность среди определенных слоев населения, а значит, должны быть
        своевременно верифицированы.<br /><br />
        Банальные, но неопровержимые выводы, а также сделанные на базе
        интернет-аналитики выводы смешаны с не уникальными данными до степени
        совершенной неузнаваемости, из-за чего возрастает их статус
        бесполезности. Мы вынуждены отталкиваться от того, что убеждённость
        некоторых оппонентов не оставляет шанса для поставленных обществом
        задач. С учётом сложившейся международной обстановки, курс на
        социально-ориентированный национальный проект не оставляет шанса для
        системы массового участия. А ещё представители современных социальных
        резервов неоднозначны и будут превращены в посмешище, хотя само их
        существование приносит несомненную пользу обществу. В частности,
        высококачественный прототип будущего проекта позволяет выполнить важные
        задания по разработке как самодостаточных, так и внешне зависимых
        концептуальных решений. Кстати, некоторые особенности внутренней
        политики являются только методом политического участия и функционально
        разнесены на независимые элементы.
      </p>
    </div>
  </div>
</template>

<script>
import gsap from 'gsap'

export default {
  name: 'AgTechView',
  components: {},
  methods: {
    beforeEnterOne(el) {
      el.style.transform = 'translateY(0)'
      el.opacity = 0
    },
    enterOne(el) {
      gsap.to(el, {
        duration: 1.5,
        y: '-100%',
        opacity: 1,
        delay: 2
      })
    },
    beforeEnterPreloader(el) {
      el.opacity = 1
    },
    enterPreloader(el) {
      gsap.to(el, {
        duration: 1,
        opacity: 0,
        delay: 1
      })
    }
  }
}
</script>

<style lang="scss">
.config__text {
  margin-top: 100px;
}
</style>
