<template>
  <div class="method">
    <div class="container">
      <div class="method__wrapper">
        <div class="method__share">
          <p class="method__share--title">Поделиться:</p>
          <div class="method__social">
            <a href="https://vk.com/" class="method__link">
              <img src="../assets/img/vk.svg" alt="" />
            </a>
            <a href="https://vk.com/" class="method__link">
              <img src="../assets/img/facebook.svg" alt="" />
            </a>
            <a href="https://vk.com/" class="method__link">
              <img src="../assets/img/twitter.svg" alt="" />
            </a>
            <a href="https://vk.com/" class="method__link">
              <img src="../assets/img/google-plus.svg" alt="" />
            </a>
          </div>
        </div>
        <div class="method__content">
          <h3 class="method__title">Реализация намеченных плановых заданий</h3>
          <p class="method__text">
            Значимость этих проблем настолько очевидна, что постоянное
            информационно-пропагандистское обеспечение нашей деятельности
            позволяет оценить значение системы обучения кадров, соответствует
            насущным потребностям. Задача организации, в особенности же
            укрепление и развитие структуры в значительной степени обуславливает
            создание форм развития. С другой стороны укрепление и развитие
            структуры способствует подготовки и реализации системы обучения
            кадров, соответствует насущным потребностям. Повседневная практика
            показывает, что укрепление и развитие структуры требуют определения
            и уточнения систем массового участия. Таким образом начало
            повседневной работы по формированию позиции позволяет выполнять
            важные задания по разработке позиций, занимаемых участниками в
            отношении поставленных задач.
          </p>
          <h3 class="method__title">
            Равным образом консультация с широким активом
          </h3>
          <p class="method__text">
            Таким образом постоянный количественный рост и сфера нашей
            активности позволяет оценить значение дальнейших направлений
            развития. Разнообразный и богатый опыт реализация намеченных
            плановых заданий влечет за собой процесс внедрения и модернизации
            направлений прогрессивного развития. Идейные соображения высшего
            порядка, а также консультация с широким активом требуют определения
            и уточнения позиций, занимаемых участниками в отношении поставленных
            задач. Равным образом дальнейшее развитие различных форм
            деятельности влечет за собой процесс внедрения и модернизации
            дальнейших направлений развития. Разнообразный и богатый опыт начало
            повседневной работы по формированию позиции позволяет оценить
            значение позиций, занимаемых участниками в отношении поставленных
            задач.
          </p>
          <p class="method__text">
            С другой стороны консультация с широким активом позволяет оценить
            значение форм развития. Идейные соображения высшего порядка, а также
            постоянное информационно-пропагандистское обеспечение нашей
            деятельности позволяет выполнять важные задания по разработке
            соответствующий условий активизации. Разнообразный и богатый опыт
            дальнейшее развитие различных форм деятельности обеспечивает
            широкому кругу (специалистов) участие в формировании соответствующий
            условий активизации. С другой стороны рамки и место обучения кадров
            влечет за собой процесс внедрения и модернизации систем массового
            участия. Равным образом консультация с широким активом в
            значительной степени обуславливает создание дальнейших направлений
            развития.
          </p>
          <p class="method__text">
            Разнообразный и богатый опыт реализация намеченных плановых заданий
            позволяет выполнять важные задания по разработке форм развития.
            Задача организации, в особенности же постоянный количественный рост
            и сфера нашей активности обеспечивает широкому кругу (специалистов)
            участие в формировании форм развития.
          </p>
          <div class="method__image">
            <img src="../assets/img/method-02.jpg" alt="" />
          </div>
          <h4 class="method__subtitle">
            Равным образом консультация с широким активом:
          </h4>
          <ul class="method__list">
            <li class="method__item">
              Идейные соображения высшего порядка, а также консультация с
              широким активом требуют определения и уточнения позиций.
            </li>
            <li class="method__item">
              С другой стороны консультация с широким активом позволяет оценить
              значение форм развития.
            </li>
            <li class="method__item">
              Разнообразный и богатый опыт реализация намеченных плановых
              заданий позволяет выполнять важные задания.
            </li>
          </ul>
          <h3 class="method__title">
            Равным образом консультация с широким активом
          </h3>
          <p class="method__text">
            С другой стороны рамки и место обучения кадров влечет за собой
            процесс внедрения и модернизации систем массового участия.
            <span>Равным образом консультация</span> с широким активом в
            значительной степени обуславливает создание дальнейших направлений
            развития. Идейные соображения высшего порядка, а также консультация
            с широким активом требуют определения и уточнения позиций,
            занимаемых участниками в отношении поставленных задач. Равным
            образом дальнейшее развитие различных форм деятельности влечет за
            собой процесс внедрения и модернизации дальнейших направлений
            развития.
          </p>
          <ul class="method__list--ordered">
            <li class="method__item--ordered">
              <span class="method__number">01.</span> Идейные соображения
              высшего порядка, а также консультация с широким активом требуют
              определения и уточнения позиций.
            </li>
            <li class="method__item--ordered">
              <span class="method__number">02.</span> С другой стороны
              консультация с широким активом позволяет оценить значение форм
              развития.
            </li>
            <li class="method__item--ordered">
              <span class="method__number">03.</span> Разнообразный и богатый
              опыт реализация намеченных плановых заданий позволяет выполнять
              важные задания.
            </li>
          </ul>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'AppMethod'
}
</script>

<style lang="scss">
.method {
  padding-top: 100px;

  &__wrapper {
    display: flex;
    justify-content: space-between;
    column-gap: 100px;
  }

  &__share {
    width: 30%;

    &--title {
      font-weight: 600;
    }
  }

  &__social {
    display: flex;
    gap: 10px;
  }

  &__link {
    padding: 13px;
    border: 1px solid #ebebf0;
    transition: all 0.3s ease;

    &:hover {
      border-color: #5c8ee6;
    }
  }

  &__content {
    width: 65%;
  }

  &__title {
    font-weight: 400;
    font-size: 36px;
    color: #292d33;
  }

  &__text {
    margin: 20px 0 50px;
    color: #292d33;
  }

  &__image {
    img {
      width: 100%;
    }
  }

  &__subtitle {
    font-size: 20px;
    color: #292d33;
    margin: 50px 0 20px;
  }

  &__list {
    display: flex;
    flex-direction: column;
    gap: 10px;
    margin-bottom: 50px;
  }

  &__item {
    position: relative;
    padding-left: 30px;
    color: #292d33;

    &::before {
      content: '';
      position: absolute;
      background: #5c8ee5;
      height: 1px;
      width: 16px;
      left: 0;
      top: 30%;
      transform: translateY(-50%);
    }
  }

  &__list--ordered {
    display: flex;
    flex-direction: column;
    gap: 10px;
  }

  &__item--ordered {
    color: #292d33;
  }

	&__number{
		color: #5c8ee5;
		font-weight: 600;
	}
}
</style>
